//!  Тема: Логические операторы js (||, ?? и т.д.) + сложные операторы (?. ||= ??= &&=)
//  Тема: Виды и разница функций
//  Тема: Виды и разница переменных
//  Тема: методы массивов - какие мутирующие, какие не мутирующие
//  Тема: контекст (this - call, apply, bind)
//  Тема: structuredClone(bar) и someArr.at()
//  Задачи: типовые задачи на массивы, строки и тд
//  Тема: Иммутабельность js Object.freeze
//  Тема: event loop
//  Тема: Файлы деклараций типов (`*.d.ts`) ts js
//  Тема: Прототипы js цепочка прототипов Object.getPrototypeOf
//  Тема: TS - generic
//  Тема: TS - utility types - что это, какие есть и что они делают
//  Тема: TS - typeGuards - что и зачем
//  Задачи: задачи интервью на TS
//  Тема: Отличие классовых и функциональных компонентов
//  Тема: Разница Redux и Redux Toolkit
//  Задачи: React - типовые задачи на собеседованиях
//  Тема: Препроцессоры (scss, less) и модульная стилизация React
//  Тема: Redux thunks
//  Тема: Промисы и их методы
//  Тема: fetch запросы
//  Тема: замыкание
//  Тема: ООП (полиморфизм, инкапсуляция, наследование, абстракция)
//  Паттерны проектирования(3 основных вида)
//  Принцип SOLID
//  REACT - виртуальный дом(оптимизация react)

//  Тема: Мета-теги
//  Тема: Чем отличается теги artcle от section
//  Тема: Типы данных js
//  Тема: Методы строк
//  Тема: Типы данных - ссылочкая(например можем перезаписывать ключи у объектов) и тд.
//  Тема: Концепции функционального программирования
//  Тема: Декораторы JS
//  React - все хуки, что они делают
//  React - useRef, зачем нужен и как использовать + задачки
//  Протоколы API
//  WEB-сокеты React

// Тема: Массивы - какие там типы данных, что такое коллекция
// Тема: Методы some и every
// Тема: MAP, SET, WeakMap и WeakSet - что они делают
// Тема: Синхронная рекурсия и асинхронная рекурсия - что может заблакировать поток event loop
// Тема: Иденпатентные запросы и ограничения по длине
// Тема: заголовки запросов и cookie
// Тема: React - useEffect и useLayoutEffect
// Тема: React - usememo и useCallback
// Тема: React - recansilation (ререндер по ключам)
// Задачи: Типовые задачи useState, useEffect, useRef, useMemo в React
// Тема: React - порталы
// Тема: Оптимизация web - frontend, бандлеры, плагины для ми нификации и тд
