//  Тема: Логические операторы js (||, ?? и т.д.)
//  Тема: Виды и разница функций
//  Тема: Виды и разница переменных
//  Тема: методы массивов - какие мутирующие, какие не мутирующие
//  Тема: контекст (this - call, apply, bind)
//  Тема: Иммутабельность js Object.freeze
//  Тема: event loop
//  Тема: Файлы деклараций типов (`*.d.ts`) ts js
//  Тема: TS - generic
//  Тема: Отличие классовых и функциональных компонентов
//  Тема: Разница Redux и Redux Toolkit
//  Тема: Препроцессоры (scss, less) и модульная стилизация React
//  Тема: Redux thunks
//  Тема: Промисы и их методы
//  Тема: fetch запросы
//  Тема: замыкание
//  Тема: ООП (полиморфизм, инкапсуляция, наследование, абстракция)
//  Паттерны проектирования(3 основных вида)
//  Принцип SOLID
//  REACT - виртуальный дом(оптимизация react)

//  Тема: Мета-теги
//  Тема: Чем отличается теги artcle от section
//  Тема: Типы данных js
//  Тема: Методы строк
//  Тема: Типы данных - ссылочкая(например можем перезаписывать ключи у объектов) и тд.
//  Тема: Концепции функционального программирования
//  Тема: Декораторы JS
//  React - все хуки, что они делают
//  React - useRef, зачем нужен и как использовать + задачки
//  Протоколы API
//  WEB-сокеты React

//! Тема: Массивы - какие там типы данных, что такое коллекция
// Тема: Методы some и every
// Тема: MAP, SET, VIKMAP и VIKSET - что они делают
// Тема: Синхронная рекурсия и асинхронная рекурсия - что может заблакировать поток event loop
// Тема: Иденпатентные запросы и ограничения по длине
// Тема: заголовки запросов и cookie
