//* Оператор ||
//! || возращает первое истинное значние
let cuurent = null;
let defaultUser = undefined;

let name = cuurent || defaultUser || "Ilya";

console.log(name); //! Выводит Ilya - первое истинное значение
________________________________________________________________;
//!  __________________________Приоритет && больше чем у ||______________________________________
________________________________________________________________;

//* Оператор &&
//! && возращает первое ложное значние
// Если первый операнд истинный
// && возвращает второй
console.log(1 && 0); // 0
console.log(1 && 5); // 5

________________________________________________________________;
________________________________________________________________;
________________________________________________________________;

//* Оператор ??
//! ?? возращает первое ОПРЕДЕЛЕННОЕ значние
const response = { enableAudio: 0 };
const enableAudioWithOr = response.enableAudio || 1; // 1
const enableAudioWithNullish = response.enableAudio ?? 1; // 0

________________________________________________________________;
________________________________________________________________;
________________________________________________________________;

//! null - object
//! undefined - undefined
//! NaN - number (например 0 / 0)
//! NaN - number (например 0 / 0)
//* console.log(null == undefined); // true (нестрогое равенство)
//* console.log(null === undefined); // false (строгое равенство)
//! NaN не равен ни одному значению, включая себя, Для проверки на NaN используется функция isNaN()

________________________________________________________________;
________________________________________________________________;
________________________________________________________________;
