//! Сравнение протоколов

//! Протокол	    Направление	        Формат данных	    Скорость	        Сложность
//* HTTP/HTTPS	    Запрос-ответ	    JSON/XML	        Средняя	            Низкая
//* WebSocket	    Двусторонний	    JSON/бинарный	    Высокая	            Средняя
//* GraphQL	        Запрос-ответ	    JSON	            Средняя            	Высокая
//* gRPC	        Запрос-ответ	    Binary	            Очень высокая	    Высокая
//* SSE	            Сервер → Клиент	    Текст	            Средняя	            Низкая
